## CSV 파일 (data.csv)

```text
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
```

## 헤더 Row가 없는 csv 데이타 읽기
header옵션의 별도 지정이 없으면 첫 행의 데이터가 열 이름이 된다

In [1]:
import pandas as pd

df = pd.read_csv("data.csv")
df

   1    3666 21st St  San Francisco          CA 94114  USA      Madeira   8
0  2  735 Dolores St  San Francisco          CA 94119  USA  Bready Shop  15
1  3     332 Hill St  San Francisco  California 94114  USA  Super River  25

## header=None 옵션
header=None 사용되는 경우 첫 번째 레코드를 데이터 레코드로 간주한다. 이 경우 열 이름으로 숫자 번호가 할당된다

In [23]:
df2 = pd.read_csv("data.csv", header=None)
df2

   0               1              2                 3    4            5   6
0  1    3666 21st St  San Francisco          CA 94114  USA      Madeira   8
1  2  735 Dolores St  San Francisco          CA 94119  USA  Bready Shop  15
2  3     332 Hill St  San Francisco  California 94114  USA  Super River  25

## 칼럼 이름 바꾸기

In [24]:
df2.columns = ["ID", "Address", "City", "ZIP", "Country", "Name", "Employees"]
df2

,ID,Address,City,ZIP,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25